src/OpenFoam/Airfoil_simulation_1/OpenFOAM_3/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (40.0 -0.0 0);

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform (40.0 -0.0 0);
    }

    exit
    {
        type            freestream;
        freestreamValue uniform (40.0 -0.0 0);
    }

    top
    {
        type            freestream;
        freestreamValue uniform (40.0 -0.0 0);
    }

    bottom
    {
        type            freestream;
        freestreamValue uniform (40.0 -0.0 0);
    }

    aerofoil
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
